from collections.abc import Sequence

Queries = Sequence[str]
SQL_Query = str

faculties: str = """INSERT INTO faculties(name)
VALUES
('Факультет информационных технологий'),
('Факультет физики и информации'),
('Факультет прикладной информатики'),
('Факультет математики'),
('Факультет химии'),
('Факультет истории'),
('Факультет права'),
('Факультет философии'),
('Факультет искусств'),
('Факультет социологии');"""

departments: SQL_Query = """INSERT INTO departments(title, faculty_id)
VALUES
('Кафедра информатики', 1),
('Кафедра теории физики и информации', 2),
('Кафедра прикладной информатики', 3),
('Кафедра теории математики', 4),
('Кафедра органической химии', 5),
('Кафедра истории России', 6),
('Кафедра уголовного права', 7),
('Кафедра философии', 8),
('Кафедра художественной грамоты', 9),
('Кафедра социологии', 10);"""
specialities: SQL_Query = """INSERT INTO specialties(title, department_id)
VALUES
('Программная инженерия', 1),
('Физика и информатика', 2),
('Информационные технологии', 3),
('Математика и информатика', 4),
('Химия', 5),
('История России', 6),
('Информатика и вычислительная техника', 7),
('Философия', 8),
('Художественная грамота', 9),
('Социология', 10);"""
subject: SQL_Query = """INSERT INTO subject(title)
VALUES
('Программирование'),
('Физика'),
('Алгоритмы и структуры данных'),
('Математика'),
('Органическая химия'),
('История России'),
('Уголовное право'),
('Философия'),
('Художественная грамота'),
('Социология');"""
subject_pass_form: SQL_Query = """INSERT INTO subject_pass_form(title)
VALUES
('Экзамен'),
('Зачет'),
('Курсовая работа'),
('Контрольная работа'),
('Тестирование'),
('Диф. зачет');"""
curriculum: SQL_Query = """INSERT INTO сurriculum(specialization_id, subject_id, subject_pass_form_id, lecture_hours, practical_hours, lab_hours, coursework_required)
VALUES
(1, 1, 3, 15, 10, 5, TRUE),
(2, 2, 1, 20, 0, 0, FALSE),
(3, 3, 2, 20, 0, 0, FALSE),
(4, 4, 3, 15, 10, 5, TRUE),
(5, 5, 1, 20, 0, 0, FALSE),
(6, 6, 2, 20, 0, 0, FALSE),
(7, 7, 3, 15, 10, 5, TRUE),
(8, 8, 1, 20, 0, 0, FALSE),
(9, 9, 2, 20, 0, 0, FALSE),
(10, 10, 3, 15, 10, 5, TRUE);"""
applicants: SQL_Query = """
INSERT INTO applicants(last_name, first_name, middle_name, sex, date_of_birth, address, phone, email, enrollment_date, specialization) 
VALUES 
("Иванов", "Иван", "Иванович", "мужской", "1995-05-10 00:00:00", "ул. Ленина, д. 10, кв. 5", "+7 (999) 123-45-67", "ivanov@mail.ru", "2021-09-01 00:00:00", 1),
("Петров", "Петр", "Петрович", "мужской", "1998-12-15 00:00:00", "ул. Пушкина, д. 5, кв. 3", "+7 (999) 234-56-78", "petrov@mail.ru", "2021-09-01 00:00:00", 2),
("Сидорова", "Анна", "Ивановна", "женский", "2000-03-20 00:00:00", "ул. Гагарина, д. 15, кв. 10", "+7 (999) 345-67-89", "sidorova@mail.ru", "2021-09-01 00:00:00", 3),
("Кузнецов", "Дмитрий", "Александрович", "мужской", "1997-06-25 00:00:00", "ул. Кирова, д. 20, кв. 7", "+7 (999) 456-78-90", "kuznetsov@mail.ru", "2021-09-01 00:00:00", 4),
("Смирнова", "Ольга", "Александровна", "женский", "1999-09-30 00:00:00", "ул. Лермонтова, д. 12, кв. 9", "+7 (999) 567-89-01", "smirnova@mail.ru", "2021-09-01 00:00:00",5),
("Лебедев", "Артемий", "Игоревич", "мужской", "1996-11-05 00:00:00", "ул. Тургенева, д. 7, кв. 2", "+7 (999) 678-90-12", "lebedev@mail.ru", "2021-09-01 00:00:00", 6),
("Федорова", "Елена", "Петровна", "женский", "1998-04-10 00:00:00", "ул. Ленинградская, д. 9, кв. 8", "+7 (999) 789-01-23", "fedorova@mail.ru", "2021-09-01 00:00:00", 7),
("Морозов", "Алексей", "Владимирович", "мужской", "1995-07-15 00:00:00", "ул. Маяковского, д. 25, кв. 12", "+7 (999) 890-12-34", "morozov@mail.ru", "2021-09-01 00:00:00", 8),
("Новикова", "Марина", "Сергеевна", "женский", "2001-01-20 00:00:00", "ул. Победы, д. 30, кв. 15", "+7 (999) 901-23-45", "novikova@mail.ru", "2021-09-01 00:00:00", 9),
("Григорьев", "Сергей", "Александрович", "мужской", "1997-08-25 00:00:00", "ул. Некрасова, д. 17, кв. 6", "+7 (999) 012-34-56", "grigorev@mail.ru", "2021-09-01 00:00:00", 10);"""

study_card: SQL_Query = """INSERT INTO study_card (id_student, group_title, specialization, subject, subject_pass_form, grade) VALUES
(1, "Группа 1", 1, 1, 1, 4),
(2, "Группа 2", 2, 2, 2, 5),
(3, "101", 3, 3, 3, 3),
(4, "Группа 2", 2, 1, 1, 3),
(5, "Группа 1", 1, 2, 2, 4),
(6, "101", 3, 3, 3, 5),
(7, "Группа 2", 2, 1, 2, 4),
(8, "Группа 1", 1, 2, 1, 5),
(9, "101", 3, 3, 2, 3),
(10, "Группа 2", 2, 1, 3, 4);"""

sql_queries: Queries = [faculties, departments, specialities, subject, subject_pass_form, curriculum, applicants,
                        study_card]
